// 请根据后端服务返回的扁平化菜单数据，整理成树状结构用于前端展示

// 已知
// 原始数据
// [{
//   "id": null,  //如果是子级（叶子结点），则是子级id；否则为null
//   "directoryId": 145, //如果是父级(目录),则是父级id；否则为null
//   "title": "测试项1", //标题
//   "parentId": null, //父节点id
//   "ts": "2021-07-15T07:23:14.675Z" //时间戳
// }, {
//   "id": 101,
//   "directoryId": null,
//   "title": "测试项2",
//   "parentId": 145,
//   "ts": "2021-07-08T08:28:19.308Z"
// }, {
//   "id": 102,
//   "directoryId": null,
//   "title": "测试项3",
//   "parentId": 145,
//   "ts": "2021-07-06T09:14:35.413Z"
// },
// ......
// {
//   "id": null,
//   "directoryId": 103,
//   "title": "测试项6",
//   "parentId": null,
//   "ts": "2021-06-24T10:58:50.992Z"
// }]

// 整理之后的数据
// [{
//   "id": 637,
//   "title": "测试项1",
//   "directoryId": null,
//   "parentId": "153",
//   "ts": "2021-08-03T03:05:43.275Z"
// }, {
//   "id": 63,
//   "title": "测试项2",
//   "directoryId": 636,
//   "parentId": null,
//   "ts": "2021-08-02T05:26:15.738Z"
//   "children":[
//     {
//       "id": 123,
//       "title": "测试项100",
//       "parentId": "636",
//       "ts": "2021-08-03T03:05:43.275Z"
//     },
//     {
//       "id": 456,
//       "title": "测试项101",
//       "parentId": "636",
//       "ts": "2021-08-03T03:05:43.275Z"
//     }
//   ]
// },
// ......
// {
//   "id": 633,
//   "title": "测试项1000",
//   "parentId": "151",
//   "ts": "2021-08-02T06:15:36.679Z"
// }]